#include<stdio.h>
int main()
{
	printf("%c%c%c\n", 'q', 'w', 'f');//多个占位符的时候按照占位符顺序后续，顺序一一对应，所以有n个占位符时，参数有n+1个（语句+占位符对应参数）
	printf("%c%c%c%d\n", 'q');//如果参数少于对应占位符，则无对应类型的可能会输出内存内的任意值，如这里多的%c不输出，但是多的%d会输出内存内的任意值
	printf("%5d\n", 12);
	printf("%5d\n", 123456);
	printf("%-10dxxx\n", 12345);//如果为负数就是向左对其
	printf("%12s\n", "asdf");//在类型前面输入数字，n为最小宽度数，代表要输出一个n位数字，会在前面补空格占位(右对其到最终位)，如果数字个数多于n则正常打印（小数点和字符都算一位）
	printf("%+d,%+d\n", -10, 10);//%+d使其默认显示正负号
	printf("%.2lf\n", 123.45);//在lf或者f前加入.n,保留n位小数
	printf("%.4lf\n", 123.123456789);//n小于位数会四舍五入到第n位
	printf("%15.4lf\n", 123.123456789);//可以组合，15表示15位数，.4为保留小数点后4位


	printf("%c\n", 'q', 'w', 1);
	printf("%c%s\n", 'q', 1, "adada");//如果在需要输出的对应变量前出现了多余的，了可能会导致程序到这一步卡死，在结尾多了则会忽略
	printf("adadssasaa");
	return 0;
}